LoginCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://xml.netbeans.org/schema/ClientRequest" xmlns:log="http://xml.netbeans.org/schema/LoginRequest">
  <soapenv:Body>
    <cli:ClientRequest>
      <log:LoginRequest>
        <log:username>laure</log:username>
        <log:password>bitch</log:password>
      </log:LoginRequest>
    </cli:ClientRequest>
  </soapenv:Body>
</soapenv:Envelope>